Revit 2024 API
View3D.CanToggleBetweenPerspectiveAndIsometric Method
 Checks whether this view can toggle between perspective and isometric.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public bool CanToggleBetweenPerspectiveAndIsometric()
Visual Basic
Public Function CanToggleBetweenPerspectiveAndIsometric As Boolean
Visual C++
public:
bool CanToggleBetweenPerspectiveAndIsometric()
Return Value
 True if this view can be toggled, false otherwise.
Remarks
 This view can only be toggled if no view specific elements are contained.
See Also
View3D Class
Autodesk.Revit.DB Namespace